"use client";

export default function PolicySection() {
  return (
    <div className="flex flex-col gap-8 max-w-5xl py-4 mx-auto text-sm md:text-base leading-7">
      <h1 className="text-xl md:text-2xl font-semibold mb-2">
        Умови користування сервісом dsgn.academy
      </h1>

      <p className="text-muted-foreground">
        <strong>Дата останнього оновлення:</strong> 05 січня 2026 року
      </p>

      <p>
        Ці Умови користування («Terms») регулюють використання сайту{" "}
        <a href="https://dsgn.academy/" className="underline" target="_blank">
          https://dsgn.academy/
        </a>{" "}
        («Веб-сайт») та будь-якого пов&apos;язаного програмного забезпечення
        dsgn.academy («Програмне забезпечення») та послуг (разом, «Послуги»), що
        надаються компанією <strong>ФОП Мамонтов Андрій Сергійович</strong> та
        її філіалами, представниками та афілійованими особами (разом,
        «dsgn.academy», «ми», «нас» або «наш»), незалежно від того, чи ви є
        платним користувачем або бажаєте отримувати доступ як непокупний
        відвідувач.
      </p>

      <p>
        Ці Умови та інші умови та політики, на які посилаються ці Умови,
        утворюють Угоду між dsgn.academy та користувачем (далі «Користувач» або
        «ви»), разом іменовані «Сторони» або кожна окремо «Сторона». Ці Умови
        регулюють ваше використання та доступ до наших Послуг, включаючи наш
        Веб-сайт та/або Програмне забезпечення, наші сповіщення та будь-яких
        матеріалів або контенту, що містяться в них.
      </p>

      <p>
        Будь ласка, також прочитайте Політику конфіденційності dsgn.academy, яка
        пояснює, як ми збираємо та використовуємо вашу особисту інформацію. Ці
        Умови є актуальними для тих, хто бажає використовувати Веб-сайт
        dsgn.academy та/або створити обліковий запис та використовувати Послуги,
        що надаються dsgn.academy.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        1. Про нас та наші послуги
      </h2>

      <p>
        Ми — компанія <strong>ФОП Мамонтов Андрій Сергійович</strong> (далі —
        «Оператор»), зареєстрована в Україні. dsgn.academy — це онлайн-платформа
        для навчання дизайну, яка надає експертно-куровані курси та навчальні
        матеріали для професіоналів та учнів у галузі дизайну. Наша платформа
        допомагає дизайнерам та студентам розвивати навички з дизайну значно
        швидше та ефективніше. Матеріали, доступні на Веб-сайті та/або надані
        Користувачу через платформу dsgn.academy, курируються з різних джерел з
        часом, щоб забезпечити, наскільки це можливо, їх актуальність та якість.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        2. Прийняття умов
      </h2>

      <p>
        Оператор є власником або має відповідні права на Веб-сайт та/або
        Програмне забезпечення і надасть Користувачу невиключну ліцензію
        відповідно до умов цієї Угоди.
      </p>

      <p>
        Ця Угода встановлює умови, на яких Оператор погодився надати ліцензію
        Користувачу на використання Веб-сайту та Програмного забезпечення. Ця
        Угода є обов&apos;язковою при будь-якому використанні Веб-сайту та
        Програмного забезпечення і застосовується до Користувача з моменту
        надання йому облікового запису («Обліковий запис Користувача») для
        доступу та використання Веб-сайту та/або Програмного забезпечення («Дата
        вступу в силу»).
      </p>

      <p>
        Отримуючи доступ та/або використовуючи Веб-сайт та/або Програмне
        забезпечення, ви:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          гарантуєте нам, що ви ознайомилися з цією Угодою, включаючи Умови
          користування Веб-сайтом та Політику конфіденційності (доступні на
          Веб-сайті), разом із вашим батьком або законним опікуном (якщо вам
          менше 18 років), і ви її розумієте;
        </li>
        <li>
          гарантуєте нам, що ви маєте законну здатність укладати юридично
          обов&apos;язувальну угоду з нами або (якщо вам менше 18 років) у вас є
          дозвіл вашого батька або законного опікуна на доступ та використання
          Сайту, і вони погодилися з Умовами від вашого імені; та
        </li>
        <li>
          зобов&apos;язуєтесь використовувати Послуги у відповідності з цією
          Угодою.
        </li>
      </ul>

      <p className="border-l-2 pl-3 italic">
        Ви не повинні створювати Обліковий запис Користувача, якщо вам менше 18
        років. Якщо ви є батьком або законним опікуном, який дозволяє особі,
        якій від 13 до 18 років (далі — «Неповнолітній»), створити Обліковий
        запис Користувача та/або використовувати Сайт, ви зобов&apos;язуєтесь:
        (i) контролювати використання Сайту Неповнолітнім та його Обліковий
        запис; (ii) взяти на себе всі ризики, пов&apos;язані з використанням
        Сайту та Облікового запису Користувача Неповнолітнім; (iii) забезпечити,
        щоб контент на Веб-сайті був придатним для Неповнолітнього; (iv)
        забезпечити, щоб вся інформація, надана нами Неповнолітнім, була точною;
        та (v) надати згоди, представництва та гарантії, що містяться в Умовах,
        від імені Неповнолітнього.
      </p>

      <p>
        Використовуючи та підписуючись на наші Послуги, ви визнаєте, що ви
        прочитали, зрозуміли та прийняли цю Угоду, і ви маєте повноваження діяти
        від імені будь-якої особи або організації, для якої ви використовуєте
        Послуги, і вважається, що ви погодилися з цією Угодою від імені
        будь-якої організації, для якої ви використовуєте Послуги.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        3. Обмеження на використання
      </h2>

      <p>
        Будь ласка, уважно прочитайте наступні обмеження та обмеження. Будь-яке
        порушення обмежень та/або обмежень, визначених у цих Умовах, може
        спричинити, за виключною дискрецією dsgn.academy, припинення вашого
        доступу до Веб-сайту та/або Програмного забезпечення, і ви можете бути
        піддані цивільній та/або кримінальній відповідальності.
      </p>

      <p>
        Використовуючи Веб-сайт та/або Програмне забезпечення, ви гарантуєте від
        свого імені, від імені своїх користувачів та інших сторін, які ви
        представляєте, що ви не будете:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          змінювати, копіювати, підготовлювати похідні роботи, розкомпілювати
          або здійснювати зворотний інженеринг будь-яких матеріалів та
          програмного забезпечення, що містяться на цьому Веб-сайті та/або
          Програмному забезпеченні;
        </li>
        <li>
          вводити будь-який код або пристрій, призначений для того, щоб
          перешкоджати або мати ефект перешкод до роботи будь-якого обладнання
          або програмного забезпечення, включаючи будь-які баги, черви, логічні
          бомби, троянські коні, віруси або будь-яку іншу самовідтворювальну
          програму, яка може зараз або спричинити збитки Послузі або системам
          dsgn.academy або іншим чином;
        </li>
        <li>
          видаляти будь-які позначення авторських прав або інші позначення
          власності з будь-яких матеріалів та програмного забезпечення на цьому
          Веб-сайті;
        </li>
        <li>
          передавати матеріали іншій особі або «дублювати» матеріали на
          будь-якому іншому сервері без попередньої письмової згоди
          dsgn.academy;
        </li>
        <li>
          свідомо або необачно використовувати цей Веб-сайт або будь-які
          пов&apos;язані з ним послуги таким чином, який зловживає або порушує
          наші мережі або будь-яку іншу послугу, яку надає dsgn.academy;
        </li>
        <li>
          використовувати цей Веб-сайт або його пов&apos;язані послуги для
          передачі або публікації будь-яких матеріалів, що переслідують,
          непристойних, шахрайських або незаконних; використовувати цей Веб-сайт
          або його пов&apos;язані послуги на порушення будь-яких застосовних
          законів або нормативних актів;
        </li>
        <li>
          використовувати цей Веб-сайт у поєднанні з відправленням
          несанкціонованої реклами або спаму;
        </li>
        <li>збирати, збирати або збирати дані користувачів без згоди;</li>
        <li>
          продавати, ліцензувати або використовувати в комерційних цілях
          будь-яке використання або доступ до контенту Послуги та/або Веб-сайту;
        </li>
        <li>
          використовувати цей Веб-сайт або його пов&apos;язані послуги таким
          чином, який може порушити приватність, права інтелектуальної власності
          або інші права третіх осіб;
        </li>
        <li>
          несанкціоновано використовувати будь-який скрейпер, робот, бот, павук,
          краулер або будь-який інший автоматизований пристрій або засіб для
          доступу, отримання, копіювання або моніторингу будь-якої частини
          Веб-сайту та/або Програмного забезпечення або будь-яких даних чи
          контенту, знайденого або отриманого через Веб-сайт; та
        </li>
        <li>
          створювати, зберігати, отримувати доступ, передавати будь-якій третій
          стороні або іншим чином розповсюджувати будь-який матеріал, який:
          <ul className="list-disc ml-6 mt-1 space-y-1">
            <li>є незаконним;</li>
            <li>
              є або містить матеріал, який є шкідливим, непристойним,
              наклепницьким, порушує права третіх осіб, включаючи права
              інтелектуальної власності третіх осіб;
            </li>
            <li>
              є або містить матеріал, який має переслідуючого або образливий
              характер;
            </li>
            <li>містить сексуально явні або інші образливі матеріали;</li>
            <li>
              пропагує використання незаконного насильства проти особи або
              майна; або
            </li>
            <li>
              є або містить матеріал, який є дискримінаційним за расою,
              походженням, переконанням, сексуальною орієнтацією, фізичною чи
              психічною інвалідністю, віком або будь-якою іншою незаконною
              категорією; або порушує будь-які з цих Умов.
            </li>
          </ul>
        </li>
      </ul>

      <p>
        Якщо ви керуєте пошуковою машиною, веб-краулером, ботом, інструментом
        скрейпінгу, інструментом видобутку даних, інструментом масового
        завантаження, утилітою wget або подібним інструментом збору або
        видобутку даних, ви можете використовувати Веб-сайт та/або Програмне
        забезпечення, в залежності від дотримання наступних умов:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>ви повинні використовувати описовий заголовок user agent;</li>
        <li>ви повинні дотримуватися robots.txt у всі часи;</li>
        <li>
          ваш доступ не повинен негативно впливати на будь-який аспект
          функціонування Веб-сайту та/або Програмного забезпечення; та
        </li>
        <li>
          ви повинні зробити ясним, як з вами можна зв&apos;язатися, або у рядку
          user agent, або на вашому веб-сайті, якщо він у вас є.
        </li>
      </ul>

      <p>
        Ви представляєте та гарантуєте, що ви не будете використовувати жодні
        автоматизовані засоби, такі як штучний інтелект або машинне навчання,
        щоб (i) створювати похідні роботи будь-яких матеріалів та програмного
        забезпечення, що містяться на цьому Веб-сайті та/або Програмному
        забезпеченні; (ii) створювати будь-яку послугу, конкурентну Послугам
        dsgn.academy, або (iii) для інших комерційних цілей, крім як прямо
        дозволено цими Умовами або письмовою згодою dsgn.academy.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        4. Облікові записи та підписки
      </h2>

      <h3 className="font-semibold mt-2">4.1 Ваш обліковий запис</h3>

      <p>
        Зареєструвавшись в обліковому записі з нами, ви повинні надати правдиву
        та точну інформацію про себе. Ви повинні захищати свій пароль (якщо він
        використовується) для Програмного забезпечення та тримати інформацію про
        ваш обліковий запис у поточному стані. Вам рекомендується
        використовувати надійний пароль, тобто пароль, який використовує
        комбінацію прописних та малих букв, цифр та символів.
      </p>

      <p>
        Не діліться деталями облікового запису та не давайте іншим доступ до
        вашого облікового запису. Зверніть увагу, що будь-яка форма спільного
        використання облікового запису (тобто один обліковий запис, який
        використовується кількома користувачами) суворо заборонена. Якщо ми
        виявимо або маємо розумні причини підозрювати будь-який випадок
        спільного використання облікового запису, це буде вважатися серйозним
        порушенням Умов, і ми матимемо право призупинити або припинити ваш
        обліковий запис після підтвердження.
      </p>

      <h3 className="font-semibold mt-4">4.2 План підписки</h3>

      <p>
        dsgn.academy пропонує різні категорії планів підписки («План(и)»). Плани
        охоплюють Безкоштовний, Місячний та Річний варіанти. В залежності від
        Плану, на який ви підписані, ви визнаєте та погоджуєтесь, що ви повністю
        обізнані з функціями Плану та правилами використання Послуг.
      </p>

      <p>Більше деталей про наші Плани можна знайти на нашому Веб-сайті.</p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">5. Умови оплати</h2>

      <p>
        Коли ви купуєте План dsgn.academy, ви прямо уповноважуєте нас або нашого
        стороннього процесора платежів стягувати плату за такий План. Ви
        гарантуєте та гарантуєте, що ви маєте законне право використовувати всі
        способи платежу, які ви надаєте нам. У разі неспроможності сплатити
        повну суму, яка вам належиться, ми можемо обмежити ваш доступ до Послуг,
        крім будь-яких інших прав або засобів правовладання, які ми можемо мати.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        6. Уповноваження на повторні платежі
      </h2>

      <p>
        Усі цінові плани передбачають повторні збори (кожна, разом з будь-якими
        застосовними податками та іншими зборами, є «Збір підписки»). В
        залежності від того, які опції ви вибрали, ці збори можуть повторюватися
        щомісячно, щоквартально або щорічно після цього за тоді чинною ставкою.
        Зверніть увагу, що наші збори підлягають змінам, хоча ми повідомимо вас
        перед внесенням будь-яких змін.
      </p>

      <p>
        Погодившись з цими Умовами та придбавши План, ви визнаєте, що ваш План
        має функції повторних платежів, і ви приймаєте відповідальність за всі
        повторні платіжні зобов&apos;язання до скасування вашого Плану вами або
        dsgn.academy. Ми (або наш сторонній процесор платежів) автоматично
        будемо стягувати вас відповідно до терміну дії вашого Плану (наприклад,
        щокварталу або щорічно) у календарний день, що відповідає початку вашого
        Плану, використовуючи платіжну інформацію, яку ви надали.
      </p>

      <p>
        У разі, якщо ваш План починається в день, який не міститься в пізнішому
        місяці, ваш спосіб платежу буде стягуватися в такий інший день, який ми
        вважаємо за потрібне. Наприклад, якщо ви почали річний План 31 січня
        2022 року, ваша наступна дата платежу, ймовірно, буде 30 січня 2023
        року, і ваш спосіб платежу буде виставлено в цю дату. Ми також можемо
        час від часу авторизувати ваш спосіб платежу у передбаченні застосовних
        зборів або пов&apos;язаних зборів.
      </p>

      <p>
        Ваш План продовжується до скасування вами або ми припиняємо ваш доступ
        до Послуг або План відповідно до цих Умов.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">7. Податки</h2>

      <p>
        Збори підписки не включають податки, і ви зобов&apos;язуєтесь сплачувати
        всі податки на продажу/використання, валові розписи, додану вартість,
        НДС, особисте майно або інший податок (включаючи будь-які штрафи та
        санкції) щодо операцій та платежів за цими Умовами.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        8. Політика повернення коштів
      </h2>

      <p>
        Повернення коштів буде запропоновано строго в цих випадках: Якщо ви не
        задоволені придбаною підпискою, ви можете запросити повернення коштів
        протягом <strong>14 днів</strong> з моменту активації підписки.
      </p>

      <p>
        Для запиту на повернення напишіть на адресу{" "}
        <a href="mailto:dsgnua.sprt1@gmail.com" className="underline">
          dsgnua.sprt1@gmail.com
        </a>{" "}
        з номером підписки та причиною повернення.
      </p>

      <p>
        Повернення буде оброблено протягом <strong>14</strong> робочих днів
        після затвердження запиту. Повернення коштів можливе тільки один раз для
        одного платіжного періоду.
      </p>

      <p>
        Якщо із закону не вимагається інше, повернення коштів не буде
        запропоновано в будь-якому іншому випадку.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        9. Політика скасування
      </h2>

      <p>
        Ви можете скасувати свій План в будь-який час, але зверніть увагу, що
        таке скасування буде дійсним лише наприкінці поточного періоду Плану.
        Якщо це не вимагається законом, ви не отримаєте повернення якої-небудь
        частини збору на підписку, сплаченого за тоді чинний період підписки на
        момент скасування.
      </p>

      <h3 className="font-semibold mt-2">
        Залишок часу доступу після скасування:
      </h3>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          За <strong>місячний план</strong> контент залишається доступним
          протягом <strong>30 днів</strong> з моменту придбання
        </li>
        <li>
          За <strong>річний план</strong> контент залишається доступним протягом{" "}
          <strong>1 календарного року</strong> з моменту придбання
        </li>
      </ul>

      <p>
        По закінченню цього терміну контент буде заблокований. Доступ можна
        поновити, активувавши нову підписку.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        10. Права інтелектуальної власності
      </h2>

      <h3 className="font-semibold mt-2">10.1 Права dsgn.academy</h3>

      <p>
        Інтелектуальна власність в матеріалах, що містяться на цьому Веб-сайті
        та/або Програмному забезпеченні, є власністю або ліцензована
        dsgn.academy і захищена застосовним законом про авторські права,
        торговельні марки та інші права інтелектуальної власності. Право
        власності, права та інтерес на інтелектуальну власність dsgn.academy
        залишаються у власності dsgn.academy або ліцензіарів третіх осіб
        dsgn.academy (де це стосується).
      </p>

      <p>
        Щодо всіх похідних робіт, створених з використанням Послуг, доступних на
        нашому Веб-сайті та/або Програмному забезпеченні, наданому вам, вони
        належать dsgn.academy. Ви повинні дотримуватися цих Умов та поважати
        права інтелектуальної власності dsgn.academy. Без обмеження прав
        dsgn.academy за цими Умовами або за будь-яким застосовним законом, вас
        попереджають, що будь-яка спроба фактичного порушення інтелектуальної
        власності dsgn.academy спричинить припинення всіх ваших прав за цими
        Умовами. Невиконання цих Умов може привести до того, що ми вживемо
        необхідні дії, які ми обґрунтовано вважаємо за потрібне.
      </p>

      <h3 className="font-semibold mt-2">10.2 Ваші права</h3>

      <p>
        dsgn.academy надає своїм Користувачам, які підписалися на Платні плани,
        дозвіл на завантаження та використання контенту виключно для особистого,
        некомерційного навчання у межах вашої підписки. Для уникнення сумнівів,
        це становить надання ліцензії, а не передачу права власності. Ця
        ліцензія автоматично припиняється, якщо Користувач порушує будь-які з
        цих обмежень або Умов і може бути припинена dsgn.academy в будь-який
        час. Вам заборонено використовувати будь-яке Програмне забезпечення, яке
        ви завантажили (у будь-якій формі), для будь-яких інших цілей, які не є
        звичайно підпорядковані нашим Послугам, включаючи, але не обмежуючись,
        відтворенням та дублюванням частини або всієї нашої Послуги. Це буде
        вважатися серйозним порушенням Умов, і dsgn.academy матиме право
        переслідувати будь-які юридичні відповідальності, пов&apos;язані з цим.
      </p>

      <h3 className="font-semibold mt-2">10.3 Контент третіх осіб</h3>

      <p>
        Наш Веб-сайт містить контент, авторські права на який належать третім
        особам. На такий контент дійсні права власників.
      </p>

      <p>
        dsgn.academy не претендує на авторство такого контенту. Платформа надає:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          <strong>Переклад</strong> контенту третіх осіб на українську мову
        </li>
        <li>
          <strong>Озвучку</strong> та інші адаптації виключно українською мовою
        </li>
      </ul>

      <p>
        Переклад та озвучка є інтелектуальною власністю dsgn.academy. Вам
        надається ліцензія на використання перекладу та озвучки на тих же
        умовах, що й для власного контенту Платформи (розділ 10.2).
      </p>

      <p>
        На всі розділи та матеріали, що містять контент третіх осіб, наведені
        посилання на оригінальні джерела та правовласників. Ви зберігаєте право
        звернутися безпосередньо до правовласника для отримання додаткової
        інформації.
      </p>

      <p>
        Посилання, цитування та перепостинг можуть бути опубліковані лише в
        обмеженому обсязі, і лише якщо вказується автор, правовласник та
        оригінальний контент.
      </p>

      <p>
        Правовласники можуть звернутися до нас з проханням видалити контент за
        адресою: <strong>ФОП Мамонтов Андрій Сергійович</strong>, або через
        email на адресу{" "}
        <a href="mailto:dsgnua.sprt1@gmail.com" className="underline">
          dsgnua.sprt1@gmail.com
        </a>
        .
      </p>

      <h3 className="font-semibold mt-2">10.4 Fair Use</h3>

      <p>
        Ви можете використовувати всі матеріали, доступні та/або надані вам на
        нашому Веб-сайті, у відповідності з справедливим використанням та
        застосовним законодавством України та міжнародним правом. Нічого в цих
        Умовах не має на меті будь-яким чином обмежити ваші права за винятками
        справедливого використання згідно із законодавством України або
        міжнародним правом щодо використання цих матеріалів.
      </p>

      <p>
        dsgn.academy відмовляється від своїх зобов&apos;язань та
        відповідальності, яка виникає в результаті вашого порушення положень про
        справедливе використання за законодавством України або іншим чином. Ви
        несете виключну відповідальність за використання будь-яких матеріалів
        поза межами Веб-сайту та Послуги.
      </p>

      <h3 className="font-semibold mt-2">
        10.5 Контент, створений користувачами
      </h3>

      <p>
        Ви зберігаєте права інтелектуальної власності на контент, який ви
        подаєте нам для публікації на нашому Веб-сайті. Ми не претендуємо та
        ніколи не претендуватимемо на право власності на ваш контент, крім
        випадків, коли ми отримаємо ліцензію від вас.
      </p>

      <p>
        Коли ви використовуєте наш Веб-сайт або його пов&apos;язані послуги для
        публікації, завантаження, спільного використання або передачі контенту,
        на який розповсюджуються права інтелектуальної власності, ви надаєте нам
        невиключну, безкоштовну, передавальну, ліцензовану, світову ліцензію на
        використання, розповсюдження, зміну, запуск, копіювання, публічне
        відображення, переклад або інакше створювати похідні роботи вашого
        контенту у спосіб, що відповідає вашим налаштуванням конфіденційності та
        нашій Політиці конфіденційності. Ліцензія, яку ви надаєте нам, може бути
        припинена в будь-який час видаленням вашого контенту або облікового
        запису. Однак, якщо ми (або наші партнери) використали ваш контент у
        зв&apos;язку з комерційним чи спонсорованим контентом, ліцензія
        продовжиться до припинення відповідного комерційного або повідомлення з
        боку нас.
      </p>

      <p>
        Ви згоджуєтесь дати нам дозвіл на використання вашого імені користувача
        та іншої ідентифікуючої інформації, пов&apos;язаної з вашим обліковим
        записом, у спосіб, що відповідає вашим налаштуванням конфіденційності та
        нашій Політиці конфіденційності.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        11. Відмова від обов&apos;язків щодо відповідальності
      </h2>

      <p>
        Наш Веб-сайт та матеріали на нашому Веб-сайті та/або Програмному
        забезпеченні надаються на «як є» основі та виключно для довідки. У
        межах, дозволених законом, dsgn.academy не надає гарантій, ні явних, ні
        припущених, і цим відмовляється та негує всі інші гарантії, включаючи,
        але не обмежуючись, припущеними гарантіями або умовами придатності для
        продажу, придатності для певної мети, або незалежності від порушення
        прав інтелектуальної власності, або інших порушень прав.
      </p>

      <p>
        У жодному разі dsgn.academy або його постачальники не несуть
        відповідальність за будь-яку наслідкову втрату, понесену або отриману
        вами або будь-якою третьою стороною, що виникла в результаті
        використання або неспроможності використовувати цей Веб-сайт або
        матеріали на цьому Веб-сайті, навіть якщо dsgn.academy або уповноважений
        представник було повідомлено, усно або письмово, про можливість такого
        збитку.
      </p>

      <p>
        За метою цих Умов «наслідкова втрата» включає будь-яку наслідкову
        втрату, непряму втрату, реальну або очікувану втрату прибутку, втрату
        переваги, втрату доходу, втрату бізнесу, втрату гарантії, втрату
        можливості, втрату заощаджень, втрату репутації, втрату використання
        та/або втрату або пошкодження даних, чи то за законом, контрактом,
        справедливістю, тортом (включаючи недбалість), відшкодуванням, або іншим
        чином.
      </p>

      <p>
        Оскільки деякі юрисдикції не дозволяють обмежень припущених гарантій або
        обмежень відповідальності за наслідкові або побічні збитки, ці обмеження
        можуть не застосовуватись до вас.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        12. Відшкодування
      </h2>

      <p>
        Ви зобов&apos;язуєтесь відшкодувати dsgn.academy і захистити від шкоди
        dsgn.academy та її працівників, посадовців, директорів та агентів, а
        також усіх третіх осіб — правовласників контенту, від та проти всіх
        претензій, збитків, витрат, видатків, втрат та зобов&apos;язань
        (включаючи, але не обмежуючись, судові витрати та видатки на повній
        основі відшкодування), які виникають прямо або опосередковано внаслідок:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          вашого доступу до та використання матеріалів на нашому Веб-сайті
          та/або Програмному забезпеченні;
        </li>
        <li>
          будь-якої претензії будь-якої третьої сторони про те, що її права
          інтелектуальної власності були порушені в результаті вашого
          використання матеріалів на нашому Веб-сайті та/або Програмному
          забезпеченні;
        </li>
        <li>
          будь-якої претензії третьої сторони про те, що будь-яке положення
          застосовного законодавства про авторські права було порушено щодо
          авторських прав в результаті вашого використання матеріалів на нашому
          Веб-сайті та/або Програмному забезпеченні; та
        </li>
        <li>будь-якого порушення цих Умов вами.</li>
      </ul>

      <p>
        Ви також визнаєте, що ви будете відповідальним користувачем і що
        dsgn.academy не буде відповідальною за спір між вами та будь-якою
        третьою стороною щодо вашого використання матеріалів на нашому Веб-сайті
        та/або Програмному забезпеченні.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        13. Точність матеріалів
      </h2>

      <p>
        Матеріали, що з&apos;являються на нашому Веб-сайті, не є вичерпними і
        призначені лише для загальних довідкових цілей. dsgn.academy не гарантує
        та не надає жодних гарантій щодо точності, ймовірних результатів або
        надійності використання матеріалів на цьому Веб-сайті або щодо таких
        матеріалів або ресурсів, пов&apos;язаних з цим веб-сайтом.
      </p>

      <p>
        Курси та матеріали на платформі dsgn.academy розроблені для навчальних
        цілей. Хоча ми докладаємо зусиль для забезпечення якості контенту,
        dsgn.academy не гарантує, що контент відповідатиме вашим конкретним
        потребам або очікуванням. Користувачі несуть відповідальність за оцінку
        придатності контенту для своїх потреб.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        14. Посилання на зовнішні веб-сайти
      </h2>

      <p>
        У разі, якщо ви через посилання переходите на будь-який зовнішній
        веб-сайт з нашого Веб-сайту, dsgn.academy не переглядала жодного такого
        зовнішнього веб-сайту і не повинна бути відповідальною за вміст жодного
        такого пов&apos;язаного сайту. Включення будь-якого посилання не означає
        схвалення, схвалення або контролю dsgn.academy. Використання будь-якого
        такого пов&apos;язаного сайту здійснюється на ваш власний ризик, і ми
        наполегливо рекомендуємо вам провести власні розслідування щодо
        придатності цих сайтів.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        15. Зміни в Умовах
      </h2>

      <p>
        dsgn.academy залишає за собою право переглянути та внести зміни до
        будь-яких з цих Умов в будь-який час за своєю виключною дискрецією. Коли
        ми це робимо, ми оновимо наш Веб-сайт та надамо вам розумне повідомлення
        про такі зміни, наприклад, на адресу електронної пошти, яку ви нам
        надали. Якщо не зазначено інше, будь-які зміни цих Умов набирають
        чинності негайно після фактичного або конструктивного повідомлення вам,
        яке включає публікацію на нашому Веб-сайті. Ваше подальше використання
        Веб-сайту та/або Програмного забезпечення після того, як dsgn.academy
        надасть таке повідомлення, підтвердить вашу згоду зі змінами.
      </p>

      <p>
        Якщо ви не згодні зі зміненими Умовами, ви повинні припинити доступ та
        використання Веб-сайту та/або Програмного забезпечення.
      </p>

      <p>
        Ми рекомендуємо вам періодично переглядати Умови для оновлень і, щоб
        уникнути сумнівів, ми не беремо на себе жодної відповідальності за
        забезпечення вашої уваги та/або розуміння цих Умов.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        16. Зміни в Послугах та Програмному забезпеченні
      </h2>

      <p>
        dsgn.academy може на власний розсуд та без попередження змінити,
        адаптувати або змінити Програмне забезпечення та/або функції Послуги,
        користувальницький інтерфейс та дизайн, обсяг та доступність матеріалу в
        Послугах та будь-який інший аспект, пов&apos;язаний з Послугами. Ви не
        матимете претензій, скарг або вимог до dsgn.academy щодо застосування
        таких змін або за невдачі, супутньої таким змінам.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        17. Право припинення
      </h2>

      <p>
        Ми можемо за своєю виключною дискрецією призупинити або припинити ваш
        доступ до нашого Веб-сайту та припинити ці Умови негайно на основі
        письмового повідомлення вам за будь-яке порушення цих Умов послуг.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        18. Коаліція (Роздільність положень)
      </h2>

      <p>
        Будь-який термін цих Умов, який повністю або частково є недійсним або не
        підлягає виконанню, вилучається в тій мірі, в якій він є недійсним або
        не підлягає виконанню. Чинність решти частини цих Умов не впливає.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        19. Застосовне право та юрисдикція
      </h2>

      <p>
        Ці Умови регулюються та тлумачаться відповідно до законів України. Ви
        безповоротно підпорядковуєтесь виключній юрисдикції судів України. Суди
        України матимуть виключну юрисдикцію на розв&apos;язання будь-яких
        спорів або претензій, що виникають або пов&apos;язані з цими умовами.
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">20. Припинення</h2>

      <p>
        Ці Умови продовжуватимуть застосовуватися до припинення одним із вас або
        нами наступним чином:
      </p>

      <p>
        Ви можете припинити використання наших Послуг в будь-який час,
        деактивувавши свій обліковий запис.
      </p>

      <p>
        Ми залишаємо за собою право призупинити або припинити ваш доступ до
        нашого Веб-сайту та/або Програмного забезпечення, якщо ми обґрунтовано
        вважаємо:
      </p>

      <ul className="list-disc ml-6 space-y-1">
        <li>
          ви серйозно або повторно порушуєте ці умови (включаючи тривале
          невиконання будь-яких платежів);
        </li>
        <li>
          ви використовуєте Веб-сайт та/або Програмне забезпечення таким чином,
          який створював би реальний ризик шкоди або втрати для нас, інших
          користувачів або громадськості;
        </li>
        <li>
          ми отримали запит від урядових або нормативних органів або як це
          вимагається за застосовним законодавством, нормативними актами або
          судовими процесами; або
        </li>
        <li>
          наше надання Веб-сайту та/або Програмного забезпечення вам більше не є
          можливим або комерційно життєздатним.
        </li>
      </ul>

      <p>
        У будь-якому з вищеперелічених випадків ми повідомимо вас через адресу
        електронної пошти, пов&apos;язану з вашим обліковим записом, або
        наступного разу, коли ви спробуєте отримати доступ до свого облікового
        запису, якщо ми не маємо право повідомити вас згідно із законом.
      </p>

      <p>При припиненні вашого доступу ці Умови також припинять дію.</p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        21. Контактна інформація
      </h2>

      <p>
        Для будь-яких запитань чи проблем, пов&apos;язаних з нашими Послугами
        та/або Веб-сайтом та/або нашим Програмним забезпеченням, або цими
        Умовами, ви можете зв&apos;язатися з нами:
      </p>

      <p>
        <strong>Email:</strong>{" "}
        <a href="mailto:dsgnua.sprt1@gmail.com" className="underline">
          dsgnua.sprt1@gmail.com
        </a>
        <br />
        <strong>Організація:</strong> ФОП Мамонтов Андрій Сергійович
        <br />
        <strong>Юридична адреса:</strong>
        <br />
        <strong>Телефон:</strong>
      </p>

      <h2 className="text-lg md:text-xl font-semibold mt-6">
        22. Контакт правовласників щодо авторських прав
      </h2>

      <p>
        Якщо ви виявили на Платформі контент, який порушує ваші авторські права
        або інші права інтелектуальної власності, повідомте нас на адресу:
      </p>

      <p>
        <strong>Email:</strong>{" "}
        <a href="mailto:dsgnua.sprt1@gmail.com" className="underline">
          dsgnua.sprt1@gmail.com
        </a>
      </p>

      <p>У повідомленні вкажіть:</p>

      <ul className="list-disc ml-6 space-y-1">
        <li>Опис контенту, що порушує ваші права</li>
        <li>
          Посилання на оригінальний контент або докази ваших авторських прав
        </li>
        <li>
          Ваші контактні дані та інформацію про те, як ви можете бути досяжні
        </li>
        <li>
          Вашу декларацію про те, що ви є правовласником або уповноважені діяти
          від його імені та що повідомлення є точним та робиться під присягою
        </li>
        <li>Вашу фізичну або електронну підпис</li>
      </ul>

      <p>
        Оператор перегляне скаргу протягом <strong>5</strong> робочих днів та
        прийме відповідні заходи, включаючи видалення контенту, якщо будуть
        підтверджені факти порушення.
      </p>

      <p className="mt-4 font-medium">Дякуємо за використання dsgn.academy</p>
    </div>
  );
}
