export const FAQ = [
  {
    question: "Що таке Dsgn Academy і навіщо вона взагалі створена?",
    answer:
      "Це платформа, створена дизайнерами для дизайнерів. \nЩоб навчання було легким, зручним і доступним, а мова не була бар’єром. \nМи вручну відбираємо найкращий контент, постійно оновлюємо базу, щоб ти завжди знав, де знайти щось якісне й корисне. \nТут зібрано все, що допоможе рости, вчитися та надихатися.",
  },
  {
    question: "Які курси тут будуть?",
    answer:
      "Тут буде багато дуже корисних курсів для дизайнерів. \nМи вже підготували офіційні курси від Figma, включно з останнім курсом для новачків і повним курсом по дизайн-системах. \nТакож ми вже працюємо над перекладом повноцінних курсів від Framer та Webflow, далі на черзі Spline, Rive та інші. \nА ще, купa крутих інтерв’ю, тематичних відео, практичні поради, конференції та багато іншого.",
  },
  {
    question: "Коли офіційно старт? І що буде доступно першими?",
    answer:
      "Офіційний запуск 25 серпня о 18:00. \nПершими будуть доступні: \n– Курси від Figma для новачків і по дизайн-системах \n– Багато крутих відео з Figma Config \n– Інтерв’ю з топ-дизайнерами \n– Та інші корисні теми, відео-розбори та практичні гайди.",
  },
  {
    question: "Скільки відео буде доступно на старті?",
    answer:
      "На старті буде понад 100 відео, включно з повноцінними курсами, виступами, інтерв’ю та практичними кейсами.",
  },
  {
    question: "Як часто будуть з’являтись нові відео?",
    answer:
      "У перший місяць оновлення будуть щодня, щоб швидко наповнити базу. \nДалі — регулярно, у міру виходу якісного контенту, який вартий перекладу.",
  },
  {
    question: "Це повні курси чи просто короткі уривки?",
    answer:
      "Буде і те, й інше: \n– Повноцінні офіційні курси \n– Короткі відео по темах \n– Тематичні добірки, серії уроків, корисні інтерв’ю та практичні поради.",
  },
  {
    question: "Чи буде пошук по відео або теги?",
    answer:
      "Так, обов’язково. Буде зручний пошук, фільтрація, теги та категорії. Знайти потрібне буде легко.",
  },
  {
    question: "Хто перекладає курси на українську?",
    answer:
      "Ми використовуємо платні професійні AI-сервіси зі збереженням інтонацій і настрою. \nДалі вручну налаштовуємо й редагуємо, щоб звучало людяно, точно й зрозуміло.",
  },
  {
    question: "Чи це все безкоштовно?",
    answer:
      "Більшість відео — безкоштовні. \nАле деякі курси та частина відео будуть платні, щоб ми могли покривати витрати на переклад, сервіси й розвиток.",
  },
  {
    question: "Чи можу я якось допомогти проєкту або долучитись до команди?",
    answer:
      "Так! Нам дуже потрібні тестери, волонтери, дизайнери обкладинок та ті, хто допоможе покращити переклади. \nНапиши нам — будемо раді ❤️",
  },
];
